[
    {
        "name": "Goldie",
        "id": 2825,
        "uri": "https://www.discogs.com/artist/2825-Goldie",
        "releases":[5630429, 5505, 10659150, 4438301, 3182540, 14837415, 9014914],
        "realname": "Clifford Joseph Price MBE",
        "profile": "British graffiti writer, drum and bass / jungle artist, DJ, actor and TV personality. \r\n\r\nBorn: 19 September 1965 in Walsall, England, UK. \r\n\r\nThe first superstar produced by the breakbeat jungle movement, Goldie popularised drum'n'bass as a form of musical expression just as relevant for living-room contemplation as techno had become by the early 1990s. Though he hardly developed the style, Goldie became one of the first personalities in British dance music, his gold teeth and b-boy attitude placing him leagues away from the faceless bedroom boffins who had become the norm in intelligent dance music. After spending several years working on his production skills at [l=Reinforced Records] (the home of [a=4 Hero]), he founded the [l=Metalheadz] label, which released seminal dark yet intelligent singles by [a=Source Direct], [a=Photek], [a=J. Majik], [a=Optical], [a=Lemon D], [a=Wax Doctor], and [a=Peshay], amongst others. He released one of jungle's first and best full-length albums with \"[m=184569]\" (1995), which put him squarely at the top of the drum'n'bass heap –at least in the minds of critics and mainstream listeners– though his follow-up album, \"[m=68958]\" (1998), displayed an ambitious, personal side of Goldie hardly in keeping with jungle's producer mentality. \r\n\r\nA native of Walsall, England, Goldie was born to a Scottish-Jamaican couple and put up for adoption. He bounced around child-care homes and several sets of foster parents during his childhood years, and became fascinated with the rise of hip-hop, breakdancing, and graffiti art. His nickname stems from \"Goldielocks\", an earlier nickname given to him during his B-boy days due to his blonde dreadlocks which was subsequently shortened when he no longer wore dreadlocks, and then adopted as his graffiti 'tag'. By 1986, he was involved with breakdancing and graffiti forming his own crews around around his home of Wolverhampton, Birmingham and the West Midlands. Whilst living on the Heat Town Estate in Wolverhampton in the 1980's, Goldie used the multiple labyrinth and concrete 'jungle' of walls, stairwells, and underpasses as his own personal canvases and gallery, producing hundreds of paintings know as 'burners' or 'pieces' (short for 'masterpieces'), often working at night to avoid detection from police and local residents. Goldie's reputation as a pioneer of aerosol art soon soon spread attracting visitors nationwide, forming a community which lead to the formation of a crew known as the 'United Graffiti Federation', of which Goldie and [a3097] were 'presidents', forming networks with the established and acting as mentors to burgeoning and up-and-coming graffiti writers. After making several trips nationwide for all-day breakdancing, graffiti and hip hop events (and in particular one show at The Shaw Theatre in London to see hip-hop pioneer [a=Afrika Bambaataa]), Goldie appeared in the English documentary on graffiti art called \"Bombing\". He also spent time in New York and Miami (working in a market stall selling customised gold teeth), but returned to England by 1988. For a time, Goldie worked at the Try 1 shop in Walsall (also selling gold teeth), then moved to London. He began hanging out with two fellow heads from the British hip-hop scene, [a=Nellee Hooper] and [a=3D] (later of [a=Massive Attack]), and by 1991 he'd been introduced to the breakbeat culture that birthed jungle; at the seminal club night 'Rage', DJs [a=Grooverider] and [a=Fabio] pitched ancient breakbeats up to 45 rpm, blending their creations with the popular rave music of the time. Goldie was hooked on the sound of raw breakbeat techno, and he gradually switched his allegiance to jungle from the British hip-hop scene that later generated trip-hop. \r\n\r\nThrough his girlfriend [a=DJ Kemistry] (later to make her name with the mixing duo [a=Kemistry & Storm]), Goldie hooked up with [a=Dego] and [a=Mark Mac], two influential figures in the emerging drum'n'bass scene. The duo's [l=Reinforced Records] and recordings as [a=4hero] were fostering an increasingly artistic attitude to the music, and Goldie learned much about breakbeat production and engineering at their studios. He recorded his first single as [a=Ajax Project], then debuted on [l=Reinforced Records] as [a=Rufige Cru] with two singles at the tale-end of the breakbeat hardcore scene, \"[url=https://www.discogs.com/Rufige-Cru-Krisp-Biscuit/master/18818]Killa Muffin[/url]\" (1992) and \"[url=https://www.discogs.com/Rufige-Cru-Darkrider/master/43197]Menace[/url]\" (1992). The single \"[m=69042]\" (1992) under name [a=Metalheads], broke him into the jungle scene, which besides pioneering the crucial jungle concept of time-stretching (basically extending a sample without altering its pitch), evinced the growing separation between the uplifting rave/hardcore scene and its emerging dark side, more reliant on breakbeats. \r\n\r\nThe name was later taken for his influential [l=Metalheadz] label, which released material from a legion of crucial jungle artists: [a=Photek], [a=Doc Scott], [a=Dillinja], [a=Source Direct], [a=Peshay], [a=J Majik], [a=Alex Reece], [a=Lemon D], and [a=Optical], amongst others. Later singles such as \"[m=68818]\" (1995) and remixes for [a=4hero]'s [l=Reinforced Records] spread Goldie's fame, and in 1994 he signed a contract with [l=London Records] offshoot [l=FFRR]. His first major-label single was \"[m=68904]\" (1994), from his debut album \"[m=184569]\" (1995). He gained additional fame in early 1996, when an American tour supporting [a=Björk] sparked a relationship between the two and led to a brief engagement period before they called off a wedding. Goldie resurfaced with a high-profile follow-up, \"[m=68958]\" (1998), with another epic two-disc set including one track, \"[url=https://www.discogs.com/Goldie-Mother-VIP-Mixes/release/9822013]Mother[/url]\" that in itself broke the 70-minute barrier. The album tanked with critics and fans, leading to a return to the underground later that year with the \"[m=68920]\" EP (1998). \r\n\r\nSave for a handful of mix albums (most notably \"[r=2988420]\" (2011)), two studio efforts credited to [a=Rufige Kru], (\"[m=48567]\" (2007) and \"[m=175795]\" (2009)), and \"[url=https://www.discogs.com/Goldie-Sine-Tempus-The-Soundtrack/master/503467]Sine Tempus[/url]\" (2008), a soundtrack to an unreleased film directed by the man himself, Goldie's career over the next two decades became less and less music-focused. He turned his hand to acting, appearing in [a=Guy Ritchie]'s film \"[url=https://www.discogs.com/Various-Snatch-Stealin-Stones-And-Breakin-Bones-Original-Film-Soundtrack/master/113967]Snatch[/url]\" (2000), the James Bond film \"[url=https://www.discogs.com/David-Arnold-The-World-Is-Not-Enough-Music-From-The-MGM-Motion-Picture/master/70037]The World Is Not Enough[/url]\" (1999), and the perennial [l=BBC] soap opera '[url=https://www.discogs.com/Simon-May-Eastenders/release/2342838]Eastenders[/url]'. He also appeared on a number of reality TV shows, including 'Maestro', where he learned how to conduct a symphony orchestra, and 'Goldie's Band: By Royal Appointment', where he put together a band of unknowns to perform at [url=https://www.discogs.com/label/974067-Buckingham-Palace-London]Buckingham Palace[/url]. \r\n\r\nHe was awarded an MBE on the Queen's 2016 Honours list for services to music and young people. A career-spanning compilation, \"[url=https://www.discogs.com/Goldie-The-Alchemist-The-Best-Of-1992-2012/release/4347524]The Alchemist[/url]\" (2013), was released by [url=https://www.discogs.com/label/33244-Rhino-Records-2]Rhino Records[/url]. Goldie's third solo studio album and first in nearly two decades, \"[m=1196432]\" (2017), was released on [l=Metalheadz] through [l=Cooking Vinyl]. Guest vocalists on the album included [a=Terri Walker], [a=Naomi Pryor], [a=José James], and [a=Natalie Duncan], the latter of which he had discovered while making 'Goldie's Band' TV show.\r\n"
    },
    {
        "name": "Peshay",
        "id": 278,
        "uri": "https://www.discogs.com/artist/278-Peshay",
        "releases":[5506, 1979353],
        "realname": "Paul Pesce",
        "profile": "UK drum 'n' bass, electronic music producer and DJ born in December 1970 in London. His first booking was at Bass Box in April 1991. Signed a record deal with [l111] in 1996."
    },
    {
        "name": "Alex Reece",
        "id": 1560,
        "uri": "https://www.discogs.com/artist/1560-Alex-Reece",
        "releases":[5507,5508],
        "realname": "Alexander Reece",
        "profile": "Drum 'n' Bass producer from Ealing, west London,. He was turned on to acid house by hearing Dave Dorrell spin at Love at the Wag club in London. During these early days of 'Warehouse' music ,Alex met up with old school friend Ron Wells (AKA Jack Smooth).\r\nWithin a few years Ron had set up his own record label (Basement/Sound Entity) and Alex got offered the chance to help/engineer for Ron and various other artists such as DJ Phantasy, Mayhem, Top Buzz, Alex Hazzard.\r\nIt was during this period that Alex also met and worked with Wax Doctor and DJ Pulse.\r\nBy late 1993 Alex (by now writing and producing with Jack Smooth) set up his own studio (Acid Lab) with his brother Oscar, and the trusty Ensoniq Sampler (used in many of the early Basement releases) that would eventually be passed to Utah Jazz!\r\nBy this time Wax Doctor, Loft Groover and Pulse would be regulars at the Ealing based studio, and in the next few years the Original Playboys (with Pim) would also be part of the team.\r\nAfter various releases on Creative Wax, Metalheadz and Basement, Alex was signed to Island Records in '95.\r\nAfter the success of 'So Far' Alex was given the chance to set up a label of his own (Als' Records) with some of his fellow artists.\r\nBut by the late nineties the record industry was cooling towards Drum 'n' Bass and a second album, although delivered, was never released.\r\nAlex continued to work with Wax Doctor on the Fallen Angels projects and with the (then) up and coming Utah Jazz until early 2003.\r\nAfter 10 years away from music, Alex is once again working with Creative Wax Records and various other projects."
    },
    {
        "name": "Doc Scott",
        "id": 1744,
        "uri": "https://www.discogs.com/artist/1744-Doc-Scott",
        "releases": [1152882,10429915,5630429,5505,10659150,10811555],
        "realname": "Scott McIlroy",
        "profile": "As well as DJing and releasing his own tunes, Scott runs the label [l=31 Records].\r\n\r\nWas monthly resident at Speed in London."
    }, 
    {
        "name": "Wax Doctor",
        "id": 785,
        "uri": "https://www.discogs.com/artist/785-Wax-Doctor",
        "releases": [1152890, 5510],
        "realname": "Paul Saunders",
        "profile": "Jungle & Drum'n'Bass producer and DJ\r\n\r\nWax Doctor recorded a second album for R&S (Sony) circa 1998 which remains unreleased."
    },
    {
        "name": "Scarface (3)",
        "id": 107769,
        "uri": "https://www.discogs.com/artist/107769-Scarface-3",
        "releases": [10811555],
        "realname": "Brad Terrence Jordan",
        "profile": "Brad Terrence Jordan (born November 9, 1970), better known as Scarface, is an American rapper, music producer and author. He hails from Houston, Texas and is a former member of the [a154551]. He is originally from South Acres, Crestmont Park neighborhood.\r\n\r\nHe began his career as [url=http://discogs.com/artist/1033757]DJ Akshen[/url], recording solo for [a632353]'s [l46705], a local label in Houston. After releasing the 12\" single [url=http://discogs.com/release/2807034]Scarface / Another Head Put To Rest[/url], he would go on to sign with [l19735] and join a group who were collectively known as [a154551], replacing one member who left, and released the group's second album [url=http://discogs.com/master/125838]Grip It! On That Other Level[/url], a highly successful album that garnered the group a large fanbase, in spite of their violent lyrics keeping them from radio and MTV.\r\n\r\nHe took his stage name from the 1983 film Scarface."
    },
    {
        "name": "Dillinja",
        "id": 315,
        "uri": "https://www.discogs.com/artist/315-Dillinja",
        "releases": [5512],
        "realname": "Karl Francis",
        "profile": "British drum’n’bass producer."

    },
    {
        "name": "J Majik",
        "id": 296,
        "uri": "https://www.discogs.com/artist/296-J-Majik",
        "releases": [5511],
        "realname": "James Spratling",
        "profile": "Though he's one of the youngest members of the Metalheadz stable, James Spratling debuted back in 1993 with tracks recorded for the Planet Earth label. Similar to the other Metalheadz, Majik's 12\"s are dark affairs, with some of the best drum'n'bass lines around, though he leavens the brew with jazzy flourishes, like the Spanish guitar prevalent on the flip side of his first single for Metalheadz, \"Your Sound\". \r\nLiving in Northwood on the edge of North West London, he began DJing in the early '90s while in his early teens and recorded \"The Choice\" aka \"6 Million Ways to Die\" in 1993 as DJ Dexxtrous. A couple more releases followed this time on his own label Infrared before the real DJ Dextrous became known to him, after which he turned to the alias J. Majik for his 1995 debut on Metalheadz, \"Your Sound\". The track was an undeniable classic, and later showed up on the Metalheadz Platinum Breakz compilation in 1996. Besides later singles for Metalheadz such as \"Jim Kutta\" and \"Arabian Knights\", Majik records for Mo'Wax as well as his own Infrared label, which released his debut LP, Slow Motion, in mid-1997. \r\n\r\nAfter this he could put other anthems into the clubs: In 2002 James was one of a selected Drum & Bass artists to reach the UK Top 40 with the classic 'Love is Not A Game' on Defected records. In that same year he won track of the year at the UK Drum & Bass awards for his remix of 'Spaced Invader' which changed the direction of the scene at the time and created a new sub Genre called Liquid DNB, which had influences of early Detroit techno and subtle house influences. \r\n\r\nHe's still releasing music in 2024."
    }, 
    {
        "name": "Asylum (9)",
        "id": 252983,
        "uri": "https://www.discogs.com/artist/252983-Asylum-9",
        "releases": [10093578, 5513],
        "realname": "Lee Johnson",
        "profile": ""
    }
]